In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'name':['Nethra','aadyan','krishna'],
                   'Rno':[523,234,432],
                   'Branch':['Cse','Eee','Ecec']})
df

      name  Rno Branch
0   Nethra  523    Cse
1   aadyan  234    Eee
2  krishna  432   Ecec

In [3]:
# To rename the single column name.
df.rename(columns={'name':'Name'},inplace=True)
df

      Name  Rno Branch
0   Nethra  523    Cse
1   aadyan  234    Eee
2  krishna  432   Ecec

In [4]:
# To rename with all the column names...
df.columns = ['NAME','ROLLNO','BRANCH']
df

      NAME  ROLLNO BRANCH
0   Nethra     523    Cse
1   aadyan     234    Eee
2  krishna     432   Ecec

In [5]:
# To rename the specific column names...
df.rename(columns={'NAME':'Name','BRANCH':'Branch'},inplace=True)
df

      Name  ROLLNO Branch
0   Nethra     523    Cse
1   aadyan     234    Eee
2  krishna     432   Ecec

In [6]:
# to rename the index names..
df.index=['A','B','C']
df

      Name  ROLLNO Branch
A   Nethra     523    Cse
B   aadyan     234    Eee
C  krishna     432   Ecec

In [7]:
# To delete the all row records.
df.drop(df.index,inplace=True)
df

Empty DataFrame
Columns: [Name, ROLLNO, Branch]
Index: []

In [8]:
# To delete the all column records.
df.drop(df.columns,inplace=True,axis=1)
df

Empty DataFrame
Columns: []
Index: []

In [9]:
df = pd.DataFrame({'name':['Nethra','aadyan','krishna'],
                   'Rno':[523,234,432],
                   'Branch':['Cse','Eee','Ecec']})
df

      name  Rno Branch
0   Nethra  523    Cse
1   aadyan  234    Eee
2  krishna  432   Ecec

### File input/Output reading in Padnas:

In [13]:
# To read the .csv file data...
df2 = pd.read_csv('Data.csv')
df2

       Name  Rollno Branch
0    aadyan     420    ece
1    ganesh     230    eee
2   narmada     510    cse
3    aaryan     234    eee
4    nethra     123  civil
5      nani     567    cse
6  jayasree     434    ece
7   sandeep     523    cse
8   krishna     101  civil
9     raghu     222    eee

In [14]:
df2.shape

(10, 3)

In [15]:
df2.columns

Index(['Name', 'Rollno', 'Branch'], dtype='object')

### Sorting:
- To get the data in either ascending order or descending order.

In [16]:
# To print the names in alphabetical order.
df2.sort_values('Name')

       Name  Rollno Branch
0    aadyan     420    ece
3    aaryan     234    eee
1    ganesh     230    eee
6  jayasree     434    ece
8   krishna     101  civil
5      nani     567    cse
2   narmada     510    cse
4    nethra     123  civil
9     raghu     222    eee
7   sandeep     523    cse

In [20]:
df2['Name'].sort_values()

0      aadyan
3      aaryan
1      ganesh
6    jayasree
8     krishna
5        nani
2     narmada
4      nethra
9       raghu
7     sandeep
Name: Name, dtype: object

In [21]:
# To print the names in decendinh order?
df2['Name'].sort_values(ascending=False)

7     sandeep
9       raghu
4      nethra
2     narmada
5        nani
8     krishna
6    jayasree
1      ganesh
3      aaryan
0      aadyan
Name: Name, dtype: object

In [22]:
df2

       Name  Rollno Branch
0    aadyan     420    ece
1    ganesh     230    eee
2   narmada     510    cse
3    aaryan     234    eee
4    nethra     123  civil
5      nani     567    cse
6  jayasree     434    ece
7   sandeep     523    cse
8   krishna     101  civil
9     raghu     222    eee

In [23]:
df2['Maths']=[24,78,14,90,65,20,89,22,45,10]
df2

       Name  Rollno Branch  Maths
0    aadyan     420    ece     24
1    ganesh     230    eee     78
2   narmada     510    cse     14
3    aaryan     234    eee     90
4    nethra     123  civil     65
5      nani     567    cse     20
6  jayasree     434    ece     89
7   sandeep     523    cse     22
8   krishna     101  civil     45
9     raghu     222    eee     10

In [30]:
df2[['Maths','Name']].sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

In [40]:
df3 = df2[['Maths','Name']].sort_values(by='Maths',ascending=False)
df3.head(1)
# To print the highest subject marks

   Maths    Name
3     90  aaryan

In [47]:
# To print the record above 50 marks..
df2.loc[(df2['Maths']>50)]

       Name  Rollno Branch  Maths
1    ganesh     230    eee     78
3    aaryan     234    eee     90
4    nethra     123  civil     65
6  jayasree     434    ece     89

In [49]:
df2[df2['maths']>50]

KeyError: 'maths'